{
	"document_tree": {
		"body": "Welcome to Sprout, a versatile and user-friendly project management tool designed to streamline your workflow and enhance productivity. \n\nHere are some key features of Sprout...\n- Document Tree Organization\n- Live Document Previews\n- Minimalistic Kanban Board\n\nAnd some things coming soon!\n- Bulk Export Documents (pdf, md, html, etc.)\n- Inter-Document linking\n- Presentation Mode\n\t- For browsing the project, rather than make changes\n- [color=RED]Maybe figure out how to not also use bbcode[/color]\n`Does this work? [color=RED] oh it does, amazing.`",
		"children": [
			{
				"body": "Sprout's document features are designed to provide a seamless and efficient way to manage all your project-related information. Here's how our document capabilities can enhance your project management experience:\n\n## Markdown Support\nCreate documents using markdown syntax for easy formatting and readability. Markdown allows you to:\n- **Quickly Format Text**: Use simple syntax to create headings, lists, links, and more.\n- **Maintain Consistency**: Ensure your documents have a consistent look and feel.\n- **Focus on Content**: Spend less time on formatting and more on writing and organizing your information.\n\n## Tree Structure Organization\nOrganize your documents in a hierarchical tree structure for easy access and management. This feature allows you to:\n- **Create a Logical Flow**: Arrange your documents in a way that makes sense for your project.\n- **Easily Navigate**: Quickly find and access the documents you need without getting lost in a flat list.\n- **Improve Collaboration**: Team members can easily understand the document structure and locate relevant information.\n\n## Toggle-able Preview Feature\nSprout includes a toggle-able preview feature, so you can see the rendered markdown while you're editing. This feature offers:\n- **Instant Feedback**: See how your document will look in its final form as you write.\n- **Error Checking**: Quickly spot and correct formatting errors.\n- **Enhanced Productivity**: Switch between editing and preview modes to refine your documents efficiently.\n\nSprout's document features are designed to help you keep all your project information organized, accessible, and easy to manage. By leveraging markdown support, a tree structure organization, and a preview feature, you can ensure that your documentation is both professional and practical.\n",
				"children": [],
				"title": "Documents"
			},
			{
				"body": "- **Simplicity Focused**: Designed to be as simple as possible, the Kanban board aims to streamline its core to-do list responsibility.\n- **Editable Headers**: Customize column headers to suit your project's needs.\n- **Task Management**: Create, edit, and move tasks across columns to track progress effortlessly.",
				"children": [],
				"title": "Kanban Board"
			}
		],
		"title": "Welcome"
	},
	"kanban": {
		"columns": []
	},
	"name": "Welcome"
}