{"document_tree":{"body":"# Overview\nGuilds of Veyrun is a tactical RPG set in the mystical, fractured world of Veyrun, where players lead a guild tasked with protecting civilization and reconnecting isolated regions. Distinguished by its permanent unit loss and unique cultures to discover, this game emphasizes strategic decision-making and discovery. The player’s tasks are manifold: to reconnect distant civilizations, defend against the dangers that lurk within and within the rifts, and to research the ancient magic that might one day heal the land of Veyrun.\n\n# Setting\nIn the serene realm of Veyrun, once unified and thriving under nature's gentle watch, a dramatic shift occurred when rifts tore through the fabric of reality, fracturing the kingdom into isolated enclaves. Each enclave, surrounded by barriers of mysterious purple magic, evolved into distinct ecosystems and cultures, cut off from one another. The rifts, though treacherous, offer paths ripe with both danger and the allure of discovery.\n\nThis upheaval unleashed creatures wielding powerful arcane magic, expressed in a mysterious language that glimmered faintly. The inhabitants of Veyrun, both intrigued and disturbed by these otherworldly beings, gradually learned to harness this enigmatic magic themselves. This discovery sparked intense debates about the nature and origin of their newfound powers, which remained as elusive as the rifts that bore them.\n\nWith traditional safeguards lost and communication severed, the disparate regions of Veyrun grew increasingly vulnerable to threats. Predatory beasts and rogue mages, drawn by the magical energies of the rifts, began to scour the lands. In this era of uncertainty and peril, the need for heroes has surged. The people of Veyrun, facing threats from all directions, urgently seek champions to defend against the looming dangers and endeavor to heal the ruptures that have torn their world apart. These emerging heroes are tasked with bridging the divided lands, sealing the magical rifts, and restoring some semblance of order to the now fragmented realm.\n\n# Gameplay\nIn the fragmented world of Veyrun, players are thrust into a rich tapestry of gameplay elements that blend tactics, social management, resource stewardship, and adventure into a cohesive and compelling experience. At the heart of the game lies the tactical deployment of heroes on a hexagonal grid, where strategic battles are fought and won through clever positioning and the exploitation of unique hero abilities, responsive to the requests of beleaguered settlements.\n\nBeyond the battlefield, the game deepens with a sophisticated social management system where heroes are not mere pawns but individuals with distinct personalities and traits. Players must navigate these complexities, balancing hero relationships and their strategic needs to maintain a harmonious and effective team. Resource management also plays a critical role, as heroes charge for their services. Managing finances through quest rewards, maintaining profitable trade routes, and efficient scheduling of hero tasks are essential for sustaining your campaigns.\n\nAdventure weaves through every aspect of gameplay, encouraging players to explore and clear rift-affected areas. This exploration is vital not only for quelling threats but also for uncovering new cultures, environments, and enemies, expanding the world and its narratives. Through this multifaceted gameplay, Veyrun offers an intricate world where every decision impacts the survival and prosperity of a realm teetering on the brink of chaos.\n\n# Art & Visuals\nI’d like to make a pixel-art aesthetic that isn’t so zoomed in that pixels are massive. Something similar to Wargroove might be best. Because your units are actual characters, I need a resolution and style that can show off the unique characteristics of a hero you choose.\n\n#Technical Specifications\n\n##Engine\nGodot will be used, primarily because it’s the only engine I have any experience in, and because open source software is pretty cool. If enough funds come from this project, I’d love to become a supporter and give back to the community.\n\n# Development Timeline\nRealistically, I will only have a 1-2 hours per day to work on this during weekdays, and not every weekend is guaranteed. Development will be slow. Documentation will help ensure I don’t lose my focus.\n\n# Monetization\nI do not plan or want in-game purchases. DLC, maybe. Price wise it’s hard to say, but I’d love to hit around $15. My reasoning is for me, that’s how much I want to spend for a game. Games that cost more than that have to have some really good reason for me to buy it, but $15 is just enough to buy it, not feel guilty about it, and play it when I have time and not feel like I have to get something out of it.\n\n# Marketing\nI tend to get Google advertising credits pretty regularly, I should look into that nearing release to get as many eyes on its release date as possible. Additionally, I think it might be nice to get on the “This week in Godot“ videos.","children":[{"body":"In the fragmented world of Veyrun, players are thrust into a rich tapestry of gameplay elements that blend tactics, social management, resource stewardship, and adventure into a cohesive and compelling experience. At the heart of the game lies the tactical deployment of heroes on a hexagonal grid, where strategic battles are fought and won through clever positioning and the exploitation of unique hero abilities, responsive to the requests of beleaguered settlements.\n\nBeyond the battlefield, the game deepens with a sophisticated social management system where heroes are not mere pawns but individuals with distinct personalities and traits. Players must navigate these complexities, balancing hero relationships and their strategic needs to maintain a harmonious and effective team. Resource management also plays a critical role, as heroes charge for their services. Managing finances through quest rewards, maintaining profitable trade routes, and efficient scheduling of hero tasks are essential for sustaining your campaigns.\n\nAdventure weaves through every aspect of gameplay, encouraging players to explore and clear rift-affected areas. This exploration is vital not only for quelling threats but also for uncovering new cultures, environments, and enemies, expanding the world and its narratives. Through this multifaceted gameplay, Veyrun offers an intricate world where every decision impacts the survival and prosperity of a realm teetering on the brink of chaos.","children":[],"title":"Gameplay"},{"body":"In the realm of Veyrun, the sudden appearance of rifts brought with them a cascade of unexplained phenomena and an undercurrent of mysterious whispers. These whispers—soft, pervasive, and seemingly part of the ambient sounds of the altered landscapes—began to permeate the areas around the rifts. \n\nThe whispers, though indecipherable, were not merely noises but strings of arcane utterances, vibrating with the potent energies of creation and transformation. Unknown to the people of Veyrun, these whispers were the voices of the Whispering Ones, discussing, planning, and weaving their influence into the fabric of the realm. As the rifts expanded and the environment grew more alien, some scholars, driven by a desperate need for answers and solutions, unconsciously began to attune themselves to these sounds.\n\nThis unwitting exposure led to the first human practitioners of magic in Veyrun. As they listened, trying to make sense of the whispers, they began to mimic the sounds and patterns, not realizing they were effectively practicing the very spells that the Whispering Ones used to manipulate reality. Each incantation, each replicated whisper, unknowingly accelerated the integration of alien magic into the world, expanding the rifts and deepening the transformation of the land.\n\nAs the inhabitants grappled with the realities of the mysterious rifts and the alien magic that now permeated their land, a schism developed among the people over the nature and use of this newfound power. On one side were those who believed that understanding and mastering the arcane whispers could lead to salvation. These optimists, primarily scholars, mages, and some daring leaders, argued that if magic had opened the rifts, then surely it could also be harnessed to close them. They dedicated themselves to studying the whispers more deeply, learning to replicate and refine the incantations in hopes of reversing the effects and restoring Veyrun to its original state.\n\nConversely, there was a significant contingent who viewed the new magic with suspicion and outright fear. This group, comprising many who had suffered directly from the changes—losing homes to altered landscapes, loved ones to transformed or newly appeared creatures, or livelihoods to shifting environments—resisted the use of such magic. They argued that dabbling in these forces had already brought untold chaos upon their world and could potentially lead to even greater disasters. They believed that the safest course was to shun the arcane arts entirely, focusing instead on physical barriers and traditional methods to protect what remained of their land.\n\nThis division in beliefs created a tense atmosphere throughout the various enclaves of Veyrun. Debates raged in public forums and private meetings, often influenced by the latest changes in the landscape or the most recent encounters with the creatures of the rifts. In some areas, the rifts' influence was so strong that the environment itself seemed to respond to the collective emotions of the inhabitants, further complicating efforts to find a unified approach to the crisis.\n\nAs the rifts expanded and the debates intensified, the once interconnected communities of Veyrun found themselves increasingly isolated, not just by ideology but by geography. The rifts, feeding on the discord and fear, grew larger and more volatile, transforming vast areas into hostile ecosystems. These new environments, steeped in alien energies, sprouted vegetation that was as dangerous as it was bizarre, and spawned creatures that were hostile to all forms of known life. Thick mists and inexplicable storms obscured paths that once linked villages and towns, effectively cutting off communication and travel between the increasingly estranged communities.\n\nAmidst this chaos, a new movement arose, born from necessity and a shared sense of urgency. Recognizing the futility of their isolation and the worsening conditions, a brave few among the settlements banded together to form guilds. These guilds, composed of individuals from all factions and beliefs, dedicated themselves to a single unifying goal: to restore the land and reconnect the divided settlements of Veyrun.","children":[{"body":"In the serene realm of Veyrun, once unified and thriving under nature's gentle watch, a dramatic shift occurred when rifts tore through the fabric of reality, fracturing the kingdom into isolated enclaves. Each enclave, surrounded by barriers of mysterious purple magic, evolved into distinct ecosystems and cultures, cut off from one another. The rifts, though treacherous, offer paths ripe with both danger and the allure of discovery.\n\nThis upheaval unleashed creatures wielding powerful arcane magic, expressed in a mysterious language that glimmered faintly. The inhabitants of Veyrun, both intrigued and disturbed by these otherworldly beings, gradually learned to harness this enigmatic magic themselves. This discovery sparked intense debates about the nature and origin of their newfound powers, which remained as elusive as the rifts that bore them.\n\nWith traditional safeguards lost and communication severed, the disparate regions of Veyrun grew increasingly vulnerable to threats. Predatory beasts and rogue mages, drawn by the magical energies of the rifts, began to scour the lands. In this era of uncertainty and peril, the need for heroes has surged. The people of Veyrun, facing threats from all directions, urgently seek champions to defend against the looming dangers and endeavor to heal the ruptures that have torn their world apart. These emerging heroes are tasked with bridging the divided lands, sealing the magical rifts, and restoring some semblance of order to the now fragmented realm.","children":[],"title":"Setting"},{"body":"In the realm of Veyrun, the landscape is a vivid tapestry of ecological diversity, shaped by the profound influences of both natural evolution and arcane disturbances. The land, once a contiguous realm of serene beauty, now presents a patchwork of distinct biomes, each marked by its own unique characteristics and life forms. However, the emergence of the rifts has woven a layer of mysticism into the environment, transforming parts of these biomes into surreal, magical variants of their former selves.\n\nThese rift-affected areas exhibit strange, often unpredictable weather patterns and plant life that defy conventional biological understanding. Here, the flora and fauna have adapted to the permeating magical energies, creating ecosystems where luminescent plants and gravity-defying landscapes are commonplace. The altered regions are both wondrous and hazardous, hosting creatures and phenomena that seem to blur the line between the magical and the material. As such, the ecology of Veyrun is not only diverse but dynamically evolving, continuously influenced by the ongoing interplay between its natural heritage and the mysterious powers of the rifts.","children":[{"body":"# Standard\nThe Veridian Deepwoods is an expansive forest biome characterized by towering ancient trees whose canopies are so thick they blot out the sun, creating a perpetually dim and misty understory. The forest floor is carpeted with lush mosses and ferns, and the air resonates with the calls of hidden birds and the rustle of small mammals scurrying through the underbrush. Streams lace through the terrain, their waters clear and cold, supporting a diverse array of aquatic life.\n\n#Rift Affected\nIn the rift-affected Veridian Deepwoods, the forest takes on a more sinister aspect. The trees glow with an eerie, phosphorescent light, casting unnatural shadows that seem to move independently of their sources. The mist is thicker and occasionally forms into shapes that whisper in forgotten tongues. The vegetation is overly vibrant, with plants that respond actively to the presence of intruders, sometimes with malevolent intent.","children":[],"title":"Viridian Deepwoods"}],"title":"Ecology"},{"body":"The biology of Veyrun is as varied and vibrant as its landscapes, with life forms that span the spectrum from the mundane to the magical. The creatures inhabiting this realm range from simple, familiar animals to beings of profound mysticism and arcane origin. In the rift-affected biomes, the fauna have absorbed and adapted to the surges of magical energy, resulting in an array of beings that defy conventional understanding.\n\nAmong these are sentient creatures, some possessing intellects rivaling those of humans, communicating in mysterious tongues and exhibiting complex social structures. Others are purely magical entities, born from the raw, chaotic energy of the rifts themselves; these beings often wield powers that can alter their surroundings or the fabric of reality in subtle but profound ways. Additionally, the land hosts an assortment of more typical wildlife, though even these \"normal\" creatures often carry a trace of magic in their veins, manifesting in minor but remarkable ways—be it through shimmering fur, glowing eyes, or unusual abilities.\n\nThis blend of the ordinary and the extraordinary gives rise to a biological ecosystem that is constantly interacting and evolving, where magic and nature intertwine to create life forms and behaviors as wondrous as they are unpredictable. The creatures of Veyrun, whether influenced by the rifts or not, contribute to a complex web of life that is as dynamic as the ever-changing realm itself.\n\n# Limitations\n\n## Size\nDue to the nature of a tactics RPG, it’s probably best to ensure all creatures fit inside of the same tile size that heroes do.\n\n## Abilities\nCreatures having abilities and effects is probably fine, but it’s probably fine if not all creatures do.\n\n## Movement\nIf I intend on spawning many of these creatures, then they probably shouldn’t move too fast, or they’d swarm players. Or, maybe they could have a sort of attention feature so that far away creatures don’t just auto-attack heroes.\n\nThe ability to fly over obstacles or terrains that normal heroes can’t might be interesting.","children":[{"body":"The Feralwood Guardian now channels purple rift magic, visually represented by vibrant, purple luminescent fungi across its body and especially concentrated around its mouth. This creature has a more defined mouth made from intertwined vines and bark, subtly blended into its facial structure, allowing it to speak the arcane language of the rifts. Its body remains humanoid, composed of bark and vines, standing upright with limbs resembling twisted tree branches.\n\n# Abilities\n- **Vine Grasp**: The Guardian can cause vines to burst from the ground, entangling an enemy unit. This immobilizes the target for one turn and deals minor damage.\n- **Mycelial Web**: By activating the fungi within its body, the Guardian creates a network of spores that spread across a designated area. Units stepping into this area have reduced movement speed and suffer a slight decrease in their attack accuracy for several turns.\n- **Regrowth**: The Guardian channels the life force of the surrounding flora to heal itself or an ally within a short range, restoring a moderate amount of health.\n- **Decay Aura**: An always-active ability, Decay Aura passively reduces the health regeneration rate of enemy units within a close proximity to the Guardian.","children":[],"title":"Feralwood Guardian"}],"title":"Beastiary"}],"title":"Story"}],"title":"Guilds of Vaerun"},"name":"Guilds of Vaerun"}